/* Rexx */
/* export a AES variable format */
signal on novalue
parse upper arg   . "-KEY" key .
trace e
if ( key   =  ""              ) then
do
   say "syntax is  -KEY key                     "
   return 8
end
say "Printing AES key "key
rc = readcks(key)
parse var rc myrc myrs vKey
if myrc <> 0 then return myrc
rc = aesprint(vkey)
parse var rc myrc myrs .
if myrc <> 0 then return myrc
