//IBMREXDH JOB 1,MSGCLASS=H,MSGLEVEL=(2,1)
//E1 EXPORT SYMLIST=*
// SET REP='-REPLACE '
// SET KEY='-KEY REXXXIM'
// SET PR='-PRIVATE ECCB512Z '
// SET PU='-PUBLIC ECCB512PUB '
//S1 EXEC PGM=IKJEFT01,REGION=0M
//SYSEXEC  DD DISP=SHR,DSN=COLIN.ICSF.REXX
//         DD DISP=SHR,DSN=COLIN.ICSF.REXX.HELPERS
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *,SYMBOLS=JCLONLY
%GAESXDH  -KEY REXXAESI &PR &PU -TYPE I &REP
%GAESXDH '-KEY REXXAESE &PR &PU -TYPE E   &REP
%GAESXDH '-KEY REXXAESC &PR &PU -TYPE C  &REP
/*
//
//SYSTSIN DD *,SYMBOLS=JCLONLY
/*
EXEC 'COLIN.ICSF.REXX(GAESEX)' '&KEY  -
  &PR &PU -
  &REP  '
