//IBMREXX  JOB 1,MSGCLASS=H,MSGLEVEL=(0,0)
//S1  EXEC PGM=IKJEFT01,REGION=0M
//SYSEXEC  DD DISP=SHR,DSN=COLIN.ICSF.REXX
//         DD DISP=SHR,DSN=COLIN.ICSF.REXX.HELPERS
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
%GPKIQ '-KEY REXXQSA  -REPLACE'
//
