//IBMREXX  JOB 1,MSGCLASS=H,MSGLEVEL=(0,0)
//S1  EXEC PGM=IKJEFT01,REGION=0M
//SYSEXEC  DD DISP=SHR,DSN=COLIN.ICSF.REXX
//         DD DISP=SHR,DSN=COLIN.ICSF.REXX.HELPERS
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//EXPORT   DD DSN=COLIN.EXPORTED.CERT,DISP=SHR,
//            SPACE=(CYL,(1,1)),DCB=(LRECL=800,RECFM=VB,BLKSIZE=3200)
//SYSTSIN DD *
%IPKI '-KEY REXXIMP2 -REPLACE '
//
