/* --------------------------------------------------------------- */
/* exists see if label exiss in pkds                               */
/* --------------------------------------------------------------- */
/* These parameters are passed in            */
parse source . . me .
parse arg label .
rc = readpks(label)
parse var rc myrc myrs .
if (myrc = 0) then
say me "exists pkds" myrc myrs label
else
say me "does not exist pkds" myrc myrs label
return myrc myrs
